{
  "Projects": [
    {
      "show": true,
      "title": "(House of Thoughts) Client Article Static Website",
      "desc": [
        "House of Thoughts is a content-driven website that promotes insightful discussions on a wide range of topics including food, politics, sports, education, and the economy. Designed with a clean, minimalist interface, the platform allows contributors to publish thought-provoking articles aimed at fostering critical thinking and awareness of contemporary issues."
      ],
      "year": "2025",
      "preview": "https://house-of-thoughts.com",
      "code": "",
      "thumbnail": "/image/projects/web/apii-portfolio/1.png",
      "images": [
        "/image/projects/web/apii-portfolio/5.png",
        "/image/projects/web/apii-portfolio/6.png",
        "/image/projects/web/apii-portfolio/7.png"
      ],
      "tech": [
        "HTML",
        "CSS",
        "JavaScript"
      ], 
      "slug": "House-of-Thoughts",
      "category": [1]
    },
    {
      "show": true,
      "title": "Borrow Book System",
      "desc": ["This Library Management System is a basic web-based project created for academic purposes. It allows users to view available books, borrow books, and return them. The system provides a simple interface to manage basic library functions and is suitable for small-scale usage or demonstration."
        ],
      "year": "2024",
      "preview": "",
      "code": "",
      "thumbnail": "/image/projects/web/library/1.png",
      "images": [
        "/image/projects/web/library/1.png",
        "/image/projects/web/library/2.png",
        "/image/projects/web/library/3.png"
      ],
      "tech": [
        "PHP",
        "HTML",
        "CSS",
        "JavaScript",
        "Bootstrap",
        "MySQL"
      ], 
      "slug": "library",
      "category": [1, 2]
    },
    {
      "show": true,
      "title": "Javanese Translation Website",
      "desc": [
        "A Javanese ngoko - krama translation website that I created as a collaborative project with my friends. The website is built using the original Transformer architecture by Vaswani et al. (2017). Built with Python, TensorFlow, Flask, HTML, and CSS, the website allows users to input text in Javanese krama and receive the corresponding ngoko translation.", 
        "The website is designed to be simple to use, with a clean and modern interface that appeals to a wide audience. Users can input text in Javanese krama and receive the corresponding ngoko translation. The Project also provide ipynb file for the model training and the model itself."
      ],
      "year": "2024",
      "preview": "",
      "code": "https://github.com/Alvalens/web-javanese-translation",
      "thumbnail": "/image/projects/ai/javanese-translation/javanese-translation-thumbnail.jpg",
      "images": [
        "/image/projects/ai/javanese-translation/javanese-translation1.png",
        "/image/projects/ai/javanese-translation/javanese-translation2.png"
      ],
      "tech": [
        "Transformers",
        "Python",
        "Tensorflow",
        "Flask",
        "HTML",
        "CSS"
      ], 
      "slug": "javanese-translation",
      "category": [2]
    },
    {
      "show": true,
      "title": "SIPETI: Heart Prediction Website",
      "desc": [
        "This is a Machine Learning based website that I created as a collage project. The website is built using Decision Tree algorithm and Flask. The website is a heart attack prediction website that can predict whether a person will get a heart attack or not based on their health condition.",
        "In this website user can predict, customize dataset, customize model, and see the model performance. The website also has a few features such as a dashboard for the user to see the model performance, and a few charts to visualize the decision tree model."
      ],
      "year": "2024",
      "preview": "",
      "code": "https://github.com/Alvalens/heart-attack-prediction",
      "thumbnail": "/image/projects/ai/heart-attack-prediction/heart-attack-prediction-thumbnail.jpg",
      "images": [
        "/image/projects/ai/heart-attack-prediction/heart-attack1.png",
        "/image/projects/ai/heart-attack-prediction/heart-attack2.png",
        "/image/projects/ai/heart-attack-prediction/heart-attack3.png",
        "/image/projects/ai/heart-attack-prediction/heart-attack4.png",
        "/image/projects/ai/heart-attack-prediction/heart-attack5.png"
      ],
      "tech": [
        "Decision Tree",
        "Python",
        "Sklearn",
        "Flask",
        "HTML",
        "CSS"
      ], 
      "slug": "heart-attack",
      "category": [2]
    },
    {
      "show": true,
      "title": "Research & Innovation Conference Grant Management System for UniKL",
      "desc": [
        "The Research & Innovation Conference Grant Management System is a web-based platform designed to streamline the application, approval, and tracking process for conference grant funding at UniKL. It enables researchers to submit proposals, manage documentation, and monitor approval statuses, while providing administrators with tools for reviewing, verifying, and reporting on grant activities efficiently. The system enhances transparency, reduces manual workload, and supports better decision-making in research funding processes."
      ],
      "year": "2025",
      "preview": "https://pesu.club/",
      "code": "https://github.com/heikaliskandar",
      "thumbnail": "/image/projects/web/fyp/1.png",
      "images": [
        
        "/image/projects/web/fyp/macbook 1.png",
        "/image/projects/web/fyp/macbook 2.png",
        "/image/projects/web/fyp/macbook 3.png"
      ],
      "tech": [
        "PHP",
        "Bootstrap",
        "JavaScript",
        "Chart.js",
        ""
      ], 
      "slug": "fyp",
      "category": [1, 2]
    },
    {
      "show": true,
      "title": "Heikal | Personal Protfolio Website",
      "desc": [ " This is a modern personal portfolio website developed using Next.js and Tailwind CSS, designed to showcase my profile as a web developer. It features a clean, responsive interface with sections for an about page, project highlights, and direct CV download. Built with a full-stack approach, the site includes dynamic routing, image optimization, and component-based architecture for efficient performance and scalability. The site reflects my skills in frontend development and serves as a professional gateway for potential clients and employers."
      ],
      "year": "2025",
      "thumbnail": "/image/projects/web/portfolio/1.png",
      "images": [
        "/image/projects/web/portfolio/1.png",
        "/image/projects/web/portfolio/2.png",
        "/image/projects/web/portfolio/3.png"
      ],
      "tech": [
        "NextJS",
        "Typescript",
        "App Router",
        "Tailwind CSS",
        "Shadcn UI"
      ], 
      "slug": "portfolio",
      "category": [1]
    }
    
  ]
}
